app/controllers/groups_controller.rb

  def update
    @group = @user_groups.find(params[:id])
    if @group.update(group_params)
---
UPDATE "groups" SET "title" = ?, "updated_at" = ? WHERE "groups"."id" = 10  [["title", "CS 1502"], ["updated_at", "2015-09-01 18:28:56.628651"]]

  def create
    @group = @user_groups.new(group_params)
    if @group.save
---
INSERT INTO "groups" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-10-22 23:01:44.123588"], ["title", "Math"], ["updated_at", "2015-10-22 23:01:44.123588"], ["user_id", 1]]

  def destroy
    @group = @user_groups.find(params[:id])
    @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 4]]

  def set_user_groups
    @user_groups = current_user.groups
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."user_id" = ? AND "groups"."id" = ? LIMIT 1  [["user_id", 1], ["id", 9]]