app/controllers/tasks_controller.rb

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 7]]
---
  def index
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 11]]
---
  def show
    @group = Group.find(params[:group_id])
    @task = Task.find(params[:id])

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]
---
  def new
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("complete", "created_at", "description", "due_date", "group_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @group = Group.find(params[:group_id])
    @task = @group.tasks.new(task_params)
    @task.complete = false
    if @task.save

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 13]]
---
  def edit
    @group = Group.find(params[:group_id])
    @task = Task.find(params[:id])

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "tasks" SET "description" = ?, "due_date" = ?, "updated_at" = ? WHERE "tasks"."id" = 4  [["description", ""], ["due_date", "2015-09-01"], ["updated_at", "2015-09-01 19:04:06.962994"]]
---
  def update
    @group = Group.find(params[:group_id])
    @task = Task.find(params[:id])
    if @task.update(task_params)

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 13]]
---
  def destroy
    @group = Group.find(params[:group_id])
    @task = Task.find(params[:id])
    @task.destroy

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."group_id" = ? AND "tasks"."id" = ? LIMIT 1  [["group_id", 1], ["id", 1]]
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["complete", "t"], ["updated_at", "2015-09-04 12:28:18.925083"]]
---
  def complete
    @group = Group.find(params[:group_id])
    task_ids = params[:task_ids]

    task_ids.each  do |task_id|
      @group.tasks.find(task_id).update(complete: true)