app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["name", "Colin J Schultz"], ["updated_at", "2015-09-09 21:52:07.037722"]]
---
  def update
    if @user.update(user_params)