app/views/layouts/_sidebar.html.erb

					<% todays_tasks.each do |task| %>
						<li><%= link_to task.title, group_task_path(task.group, task) %> (<%= task.group.title %>)</li>
---
SELECT "groups".* FROM "groups"